tutorials/reactingFoam/counterFlowFlame2D_GRI_PYJAC/Allrun
export PYJAC_INC=/home/peltonp1/OpenFOAM/peltonp1-6/applications/openfoam-pex_own/ThirdParty/pyjac/currentPyJacLib/out
export PYJAC_LIB=/home/peltonp1/OpenFOAM/peltonp1-6/applications/openfoam-pex_own/ThirdParty/pyjac/currentPyJacLib/build                    
export LD_LIBRARY_PATH=$PYJAC_LIB:$LD_LIBRARY_PATH


rm -rf 0.*
rm -rf processor*
rm -rf log*
blockMesh > log.blockMesh
decomposePar > log.decompose
N_PROCS=$(find processor* -maxdepth 0 -type d | wc -l)
mpirun -np $N_PROCS reactingFoam -parallel




