tutorials/reactingFoam/counterFlowFlame2D_GRI_PYJAC/constant/mixtureFractionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      mixtureFractionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

oxidizerMassFractions
{
    N2       0.77;
    O2       0.23;
}

fuelMassFractions
{
    CH4       1.0;
}


#include "$FOAM_CASE/constant/specieElements_GRI.foam"


// ************************************************************************* //
