tutorials/reactingFoam/counterFlowFlame2D_GRI_PYJAC/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

inertSpecie N2;
chemistryRefCellFuelName CH4;
Yf_refCell               0.0;
Yox_refCell          0.01;



chemistryReader foamChemistryReader;
foamChemistryFile "$FOAM_CASE/constant/chem.foam";
foamChemistryThermoFile "$FOAM_CASE/constant/thermoProps_GRI.foam";


// ************************************************************************* //
